app/controllers/donuts_controller.rb

  def index
    @donuts = Donut.all
---
SELECT "donuts".* FROM "donuts"

  def show

    @donut = Donut.find(params[:id])
---
SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    donut_params = params.require(:donut).permit(:name, :size, :frosting_type)
    @donut = Donut.create(donut_params)
---
INSERT INTO "donuts" ("name", "size", "frosting_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jelly filled"], ["size", "large"], ["frosting_type", "powdered sugar"], ["created_at", "2018-10-29 11:58:20.136721"], ["updated_at", "2018-10-29 11:58:20.136721"]]